[
    {
      "id":1,
      "url":"test-url-1",
      "img":"article1Image.jpg",
      "cardTitle":"How to Prepare for a New Metagame",
      "title":"How to Prepare for a New Metagame in Flesh and Blood",
      "content":[
        "With Everfest around the corner and a multitude of high level tournaments following shortly, it's important to have a clear idea on how to approach a new metagame. It's an exciting time, where all players are exploring new strategies and there is a lot of uncertainty in the air. While it might be hard to create the perfect deck, I will outline the ways you can streamline your testing process and focus on what's important to give you the edge in the upcoming Pro Quest season.",
        "From what we know about Everfest, every hero will be getting new toys to play around with. This expands the card pool for everyone. At the same time, the previous metagame is still a strong indicator for what top decks to expect. There are two reasons for this. First, the best performing decks won't get worse overnight. There might be new strategies out there that can be good against them, but if an overall power level of a deck is high, chances are it will remain powerful into the wider field. Second, players piloting these decks are very comfortable with them, meaning it's unlikely we will see a major shift of players switching heroes or classes straight after the release of a new set.",
        "For testing purposes, I recommend you start off with testing your new builds into the established metagame. It's a good sign to see new builds perform well into these established decks, even if they don't run new cards yet. The next step would be to test those into the meta decks after they have been upgraded with Everfest cards. There is a strong probability players will upgrade their existing decks with Everfest cards at first, rather than starting from ground up. This is purely based on the time and availability constraints and comfort levels of players going into a tournament. Some of the first Pro Quests are the week after Everfest becomes tournament legal.",
        "For example, let's say you've been playing Bravo, the Showstopper and putting up great results with a clear fatigue control strategy. You felt confident into the Tales of Aria metagame, fatiguing aggro Briars and Lexis, while holding your own against Oldhim. Now you want to try a new strategy with Everfest cards. If the new strategy is not giving you the same results into those same decks as your previous ones, it should be a clear signal that it is not viable and either has to be adjusted or changed. Testing into a clear gauntlet of decks can help you discard strategies that aren't viable and save precious time. If the new strategy performs on par or better, it's time to streamline it with the wider field in mind.",
        "While metagaming and trying to create a deck that counters specific decks and builds is the way to get ahead in an established metagame, for a brand new metagame, I recommend focusing on your own strategy. I call these decks “silver bullet” decks. Their overall power level is quite low, but they excel against particular strategies and can put up results in a specific metagame.",
        "With the 15 existing heroes getting new cards, it will simply be too hard to predict what the new metagame will look like. While many old decks will continue to see play, more and more wild card decks will appear, especially at the start of the season. This is why you should choose a hero that has an established power level and that you feel comfortable playing into the wider field, even if the decks that you were familiar playing against might have new tools and sub-strategies that make it difficult to consistently counter. Having a proactive game plan means focusing on what you're doing really well, rather than trying to counter strategies your opponent's are implementing.",
        "Let's say you've been putting up really good results with Ice Lexi. The deck has worked wonders in your local tournaments, because of the prevalence of aggro Briars. You know the matchup inside out, and feel confident that your strategy counters theirs. But with the emergence of completely new decks, you need to see if your strategy is viable in a wider field. Can you hold your own against aura Prism? Or new Boltyn builds? It's important to understand the overall power level of your deck. If the deck isn't strong into the wider field, but is great into a specific deck, you need to remake it with a proactive strategy in mind, opposed to countering a particular one. This will ensure you know what to do into completely unexpected decks and builds.",
        "With an 80-card main deck, there's always wiggle room for extra cards to compliment your proactive strategy. I recommend focusing those extra slots on cards that help you play into particular strategies rather than particular decks. Having a versatile range of preboard options can be more effective into a wider field than having set cards for very specific matchups.",
        "For example, you've been playing Mount Heroic Briar in the Tales of Aria metagame. Your core preboard strategy against control Oldhim has been Lightning Press (Red). You've tried to time it to blow them out when they try to use Oldhim's Ice hero ability when you have only one card left in hand. By playing the Lightning Press in response to getting iced, you've pushed through damage and countered their play.",
        "This is a very particular scenario. While it could have been effective, having such particular pre-board strategies is great in an established metagame, but not so much into a wider field. Rather than focusing on those particular interactions, I recommend you plan your pre-board cards based on potential archetypes. Like with the control Oldhim example, rather than focus on the particular matchup, try to find cards that work against the overall fatigue archetype. Whether it's Katsu Control, Bravo, Oldhim or maybe even new fatigue decks that emerge, your preboard slot will be more versatile. A red Evergreen is an example of a substitute that works into a multitude of fatigue matchups. Even though it might not be as effective against Oldhim as your red Lightning Press, you're more likely to find it useful into those wildcard decks. Versatility is key when playing into a wider field.",
        "Everfest is gearing up to be a wild wild west in terms of new deck design possibilities. Experimentation and innovation are going to be the key components to putting up successful results in the tournaments coming up. However, despite all the innovation, old, tried and true heroes with a high power level should continue to be a solid benchmark for your testing. Testing against the powerful old builds, as well as identifying new deck powerhouses, will streamline your testing process. Speedy iterations and failing quickly will help you discard strategies that don't work and find the ones that do work quicker, giving you more time to refine the list in a short space of time. As you refine your main deck, having versatile preboard options means you will get more utility from those extra cards playing into a wide range of decks."
      ]
    },
    {
        "id":2,
        "url":"test-url-2",
        "img":"../assets/articles/article2Image.jpg",
        "cardTitle":"test title 2",
        "title":"test title 2",
        "content":[
          "Test paragraph 1 in here",
          "Test paragraph 2 in here"
        ]
      }
]